<template>
  <div class="constructor-instruction">
    <p class="text-14 weight-500">Как работает конструктор шаблона</p>

    <ol>
      <li>Шаблон состоит из этапов, каждый этап — из шагов</li>
      <li>Шаг — это один вызов нейросети (провайдер + модель)</li>
      <li>Шаги внутри этапа выполняются строго по порядку</li>
      <li>Результат этапа — это результат последнего шага</li>
      <li>
        Контекстные этапы не создают итогового результата, но влияют на
        следующие шаги
      </li>
      <li>
        Шаги могут использовать результаты предыдущих шагов и этапов через
        переменные
      </li>
      <li>
        Перед сохранением все обязательные параметры должны быть заполнены
      </li>
    </ol>
  </div>
</template>

<style lang="scss">
.constructor-instruction {
  display: flex;
  flex-direction: column;
}
</style>
