export const ARTIFACTS_EMPTY_DESCRIPTION =
  'Артефакты пока не созданы.<br>Создайте текстовый или бинарный артефакт для использования в шаблонах.';

export const MY_PRIVATE_FLOWS_EMPTY_DESCRIPTION =
  'Шаблоны пока не созданы.<br>Создайте приватный шаблон, чтобы начать автоматизировать генерацию контента.';

export const MY_PUBLIC_FLOWS_EMPTY_DESCRIPTION =
  'Пока нет публичных шаблонов.<br>Здесь будут отображаться приватные шаблоны, которые были отправлены на публикацию и прошли модерацию.';

export const MARKETPLACE_FLOWS_EMPTY_DESCRIPTION =
  'Шаблонов в маркетплейсе пока нет.<br>В будущем здесь будут шаблоны от сообщества.';

export const RAW_POSTS_EMPTY_DESCRIPTION =
  'Посты пока отсутствуют.<br>Запустите генерацию в шаблоне, чтобы результаты появились здесь.';

export const SOCIAL_POSTS_EMPTY_DESCRIPTION =
  'Посты пока отсутствуют.<br>Опубликуйте пост через форму результатов генрации, чтобы результаты появились здесь.';

export const NEWS_EMPTY_DESCRIPTION =
  'Новости пока не добавлены.<br>Создайте первую новость, чтобы она отобразилась на сайте.';
